[
  {
    "name": "Citronix",
    "desc": "Citronix is a farm management system, developed using Spring Boot, designed to optimize lemon production, harvest, and sales.",
    "image": "flipkartmern",
    "category": "mern",
    "links": {
      "code": "https://github.com/J-Maryam/Citronix"
    }
  },
  {
    "name": "YouQuiz",
    "desc": "YouQuiz is a Spring Boot application for managing online exams and quizzes, enabling trainers to easily create, schedule, and administer assessments, while allowing students to take exams multiple times as needed.",
    "image": "flipkartmern",
    "category": "mern",
    "links": {
      "code": "https://github.com/J-Maryam/YouQuiz"
    }
  },
  {
    "name": "WaitingRoom",
    "desc": "WRM est une API REST pour la gestion des salles d'attente, développée pour organiser et gérer les flux de visiteurs dans divers types d'établissements tels que des cabinets médicaux, des services publics ou des entreprises.",
    "image": "resumegen",
    "category": "mern",
    "links": {
      "code": "https://github.com/J-Maryam/WaitingRoom"
    }
  },
  {
    "name": "E-Banking",
    "desc": "E-Banking is a REST API project using Spring Security with Basic Authentication, ensuring role-based access control and robust user management.",
    "image": "reactprojects",
    "category": "mern",
    "links": {
      "code": "https://github.com/J-Maryam/eBanking"
    }
  },
  {
    "name": "ITLens",
    "desc": "ITLens : API REST dédiée à la gestion de sondages pour le secteur IT, permettant la création de sondages structurés, la collecte des réponses, et l'analyse des résultats en temps réel. Conçue avec Spring Boot et une base de données relationnelle.",
    "image": "flipkartphp",
    "category": "lamp",
    "links": {
      "code": "https://github.com/J-Maryam/ITLens"
    }
  },
  {
    "name": "Bati-Cuisine",
    "desc": "Bati-Cuisine is a Java application designed for construction and kitchen renovation professionals, enabling cost estimation for projects by factoring in materials, labor, and logistics for efficient project management.",
    "image": "jspro",
    "category": "basicweb",
    "links": {
      "code": "https://github.com/J-Maryam/Bati-Cuisine"
    }
  }
  ]
